
///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВключенаФункциональнаяОпцияЗаказыИспользуютсяДляРезервированияИОтгрузки()","ВключенаФункциональнаяОпцияЗаказыИспользуютсяДляРезервированияИОтгрузки","И включена Функциональная опция Заказы Используются для резервирования и отгрузки","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВключенаФункциональнаяОпцияИспользованиеДоговоровСКлиентами()","ВключенаФункциональнаяОпцияИспользованиеДоговоровСКлиентами","И включена функциональная опция Использование договоров с клиентами","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ПроверяюЧтоИспользуетсяУчетРасчетовПоЗаказам()","ПроверяюЧтоИспользуетсяУчетРасчетовПоЗаказам","И Проверяю что используется учет расчетов по Заказам","","");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//И включена Функциональная опция Заказы Используются для резервирования и отгрузки
//@ВключенаФункциональнаяОпцияЗаказыИспользуютсяДляРезервированияИОтгрузки()
Процедура ВключенаФункциональнаяОпцияЗаказыИспользуютсяДляРезервированияИОтгрузки() Экспорт
	
	ИспользоватьЗаказыКлиентов = ПолучитьФункОпц("ИспользоватьЗаказыКлиентов");
	
	Ванесса.ПосмотретьЗначение(ИспользоватьЗаказыКлиентов,Истина);
	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры
&НаСервере
Функция ПолучитьФункОпц(ФункОпция)
	Возврат ПолучитьФункциональнуюОпцию(ФункОпция);
	//ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"
КонецФункции
&НаКлиенте
//И включена функциональная опция Использование договоров с клиентами
//@ВключенаФункциональнаяОпцияИспользованиеДоговоровСКлиентами()
Процедура ВключенаФункциональнаяОпцияИспользованиеДоговоровСКлиентами() Экспорт
	ИспользоватьДоговоры = ПолучитьФункОпц("ИспользоватьДоговорыСКлиентами");
	Ванесса.ПосмотретьЗначение(ИспользоватьДоговоры,Истина);
	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И Проверяю что используется учет расчетов по Заказам
//@ПроверяюЧтоИспользуетсяУчетРасчетовПоЗаказам()
Процедура ПроверяюЧтоИспользуетсяУчетРасчетовПоЗаказам() Экспорт
	
	
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры
