
&НаКлиенте
Процедура Тест(Команда)
	Если МассивОбъектов.Количество()>0 Тогда
		СоответствиеТаблДокументов = Новый Соответствие;
		ВызватьПолучениеТабДок(СоответствиеТаблДокументов);	
		
		//выводим окна с табличными документами
		Для каждого ЭлементСоответствия Из СоответствиеТаблДокументов Цикл
			ЭлементСоответствия.Значение.Показать(ЭлементСоответствия.Ключ);
		КонецЦикла; 
	иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одного тестового объекта";
		Сообщение.Сообщить();
	КонецЕсли; 	
КонецПроцедуры


// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ВызватьПолучениеТабДок(СоответствиеТаблДокументов)

	ИдентификаторКоманды = "КоммПредл"; //тот же - что и в функции "СведенияОВнешнейОбработке" модуля обработки!
	ОбъектОбр = РеквизитФормыВЗначение("Объект");
	//КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(ИдентификаторКоманды);
	КоллекцияПечатныхФорм = ПодготовитьКоллекциюПечатныхФорм(ИдентификаторКоманды);
	ОбъектыПечати =  Новый СписокЗначений;
		
	Масс = Новый Массив;
	Для каждого ЭлмСписка Из МассивОбъектов Цикл
	     Масс.Добавить(ЭлмСписка.Значение);
	КонецЦикла; 
	
	ОбъектОбр.Печать(Масс, КоллекцияПечатныхФорм, ОбъектыПечати, Новый  Структура("ДоступнаПечатьПоКомплектно",Ложь));
	//подготовим визуализацию полученных печатных форм
	Для каждого ТекПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
	       СоответствиеТаблДокументов.Вставить(ТекПечатнаяФорма.ИмяМакета,ТекПечатнаяФорма.ТабличныйДокумент);
	КонецЦикла; 

		
	
КонецПроцедуры // ВызватьПолучениеТабДок()

Функция ПодготовитьКоллекциюПечатныхФорм(Знач Идентификаторы)
	
	Результат = Новый ТаблицаЗначений;
	Для Каждого ИмяКолонки Из УправлениеПечатьюКлиентСервер.ИменаПолейКоллекцииПечатныхФорм() Цикл
		Результат.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	Если ТипЗнч(Идентификаторы) = Тип("Строка") Тогда
		Идентификаторы = СтрРазделить(Идентификаторы, ",");
	КонецЕсли;
	
	Для Каждого Идентификатор Из Идентификаторы Цикл
		ПечатнаяФорма = Результат.Найти(Идентификатор, "ИмяМакета");
		Если ПечатнаяФорма = Неопределено Тогда
			ПечатнаяФорма = Результат.Добавить();
			ПечатнаяФорма.ИмяМакета = Идентификатор;
			ПечатнаяФорма.ИмяВРЕГ = ВРег(Идентификатор);
			ПечатнаяФорма.Экземпляров = 1;
		Иначе
			ПечатнаяФорма.Экземпляров = ПечатнаяФорма.Экземпляров + 1;
		КонецЕсли;
	КонецЦикла;
	
	Результат.Индексы.Добавить("ИмяВРЕГ");
	Возврат Результат;
	
КонецФункции

 