&НаСервере
Функция ПечатьНаСервере()
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Документ);
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("М29");
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	ОбъектыПечати = Новый СписокЗначений;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	Возврат КоллекцияПечатныхФорм.ВыгрузитьКолонку("ТабличныйДокумент");
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	МассивТабличныхДокументов = ПечатьНаСервере();
	Для Каждого ТабличныйДокумент Из МассивТабличныхДокументов Цикл 
		Если ТабличныйДокумент <> Неопределено Тогда 
			ТабличныйДокумент.Показать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры