<<<<<<< HEAD
﻿//ПОДГОТОВКА РЕГИСТРАЦИИ ОБРАБОТКИ

// Интерфейс для регистрации обработки.
// Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение:
// Структура:
// Вид - строка - возможные значения:	"ДополнительнаяОбработка"
//										"ДополнительныйОтчет"
//										"ЗаполнениеОбъекта"
//										"Отчет"
//										"ПечатнаяФорма"
//										"СозданиеСвязанныхОбъектов"
//
// Назначение - массив строк имен объектов метаданных в формате:
//			<ИмяКлассаОбъектаМетаданного>.[ * | <ИмяОбъектаМетаданных>]
//			Например, "Документ.СчетЗаказ" или "Справочник.*"
//			Прим. параметр имеет смысл только для назначаемых обработок
//
// Наименование - строка - наименование обработки, которым будет заполнено
//						наименование справочника по умолчанию - краткая строка для
//						идентификации обработки администратором
//
// Версия - строка - версия обработки в формате <старший номер>.<младший номер>
//					используется при загрузке обработок в информационную базу
// БезопасныйРежим – Булево – Если истина, обработка будет запущена в безопасном режиме.
//							Более подбробная информация в справке.
//
// Информация - Строка- краткая информация по обработке, описание обработки
//
// ВерсияБСП - Строка - Минимальная версия БСП, на которую рассчитывает код
// дополнительной обработки. Номер версии БСП задается в формате «РР.ПП.ВВ.СС»
// (РР – старший номер редакции; ПП – младший номер ре-дакции; ВВ – номер версии; СС – номер сборки).
//
// Команды - ТаблицаЗначений - команды, поставляемые обработкой, одная строка таблицы соотвествует
//							одной команде
//				колонки: 
//				 - Представление - строка - представление команды конечному пользователю
//				 - Идентификатор - строка - идентефикатор команды. В случае печатных форм
//											перечисление через запятую списка макетов
//				 - Использование - строка - варианты запуска обработки:
//						"ОткрытиеФормы" - открыть форму обработки
//						"ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//						"ВызовСерверногоМетода" - вызов серверного экспортного метода из модуля объекта обработки
//				 - ПоказыватьОповещение – Булево – если Истина, требуется оказывать оповещение при начале
//								и при окончании запуска обработки. Прим. Имеет смысл только
//								при запуске обработки без открытия формы.
//				 - Модификатор – строка - для печатных форм MXL, которые требуется
//										отображать в форме ПечатьДокументов подсистемы Печать
//										требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); //Варианты: "ДополнительнаяОбработка", "ДополнительныйОтчет", "ЗаполнениеОбъекта", "Отчет", "ПечатнаяФорма", "СозданиеСвязанныхОбъектов" 
	
	МассивНазначений = Новый Массив();
	МассивНазначений.Добавить("Документ.РеализацияТоваровУслуг");// например: "Документ._ДемоСчетНаОплатуПокупателю"
	МассивНазначений.Добавить("Документ.ПриобретениеТоваровУслуг");
	МассивНазначений.Добавить("Документ.ЗаказКлиента");
	МассивНазначений.Добавить("Документ.ЗаказПоставщику");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	
	ПараметрыРегистрации.Вставить("Наименование", "Реестр сертификатов");
	ПараметрыРегистрации.Вставить("Версия", "1.4"); //например: "1.0"
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина); //Варианты: Истина, Ложь
	ПараметрыРегистрации.Вставить("Информация", "");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.0.3.64");// не ниже какой версии БСП подерживается обработка
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
	НСтр("ru = 'ВНЕШНИЙ: Реестр сертификатов'"),//для отображения пользователю
	"РеестрСертификатов",    //можно использовать для подмены поставляемой печатной формы
	"ВызовСерверногоМетода",  //Использование.  Варианты: "ОткрытиеФормы", "ВызовКлиентскогоМетода", "ВызовСерверногоМетода"   
	Ложь,//Показывать оповещение. Варианты Истина, Ложь 
	"ПечатьMXL",//Модификатор 
	""); //Строка с идентификаторами заменяемых внутренних печатных форм. Например "Счет,Заказ"
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ЗаменяемыеКоманды", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "",ЗаменяемыеКоманды = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	НоваяКоманда.ЗаменяемыеКоманды = ЗаменяемыеКоманды;
	
КонецПроцедуры



//ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода = Неопределено)  экспорт 
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрСертификатов") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"РеестрСертификатов", //тот же - что и в функции "СведенияОВнешнейОбработке"! 
		"Имя закладки 1 при печати комплектом", 
		СформироватьПечатнуюФорму1(МассивОбъектов, ОбъектыПечати)//исполняющая функция (в этом же модуле)
		);
	КонецЕсли;
	
КонецПроцедуры				

Функция СформироватьПечатнуюФорму1(МассивОбъектов, ОбъектыПечати)	
	
	//формирование табличного документа ТабДок
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПараметрыПечати_<УникальныйКлюч1>";	
	
	Макет = ПолучитьМакет("ПФ_MXL_РеестрСертификатов");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Номенклатура.ВестиУчетСертификатовНоменклатуры КАК ВестиУчетСертификатовНоменклатуры,
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка,
	|	ПриобретениеТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	|	ПриобретениеТоваровУслугТовары.Ссылка.Организация КАК Организация,
	|	ПриобретениеТоваровУслугТовары.Ссылка.Номер КАК Номер,
	|	ПриобретениеТоваровУслугТовары.Ссылка.Дата КАК Дата,
	|	ТИПЗНАЧЕНИЯ(ПриобретениеТоваровУслугТовары.Ссылка) КАК ТипДокумента
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Номенклатура.ВестиУчетСертификатовНоменклатуры,
	|	РеализацияТоваровУслугТовары.Ссылка,
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент,
	|	РеализацияТоваровУслугТовары.Ссылка.Организация,
	|	РеализацияТоваровУслугТовары.Ссылка.Номер,
	|	РеализацияТоваровУслугТовары.Ссылка.Дата,
	|	ТИПЗНАЧЕНИЯ(РеализацияТоваровУслугТовары.Ссылка)
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В(&МассивОбъектов)
	|	И РеализацияТоваровУслугТовары.Номенклатура.ВестиУчетСертификатовНоменклатуры = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Номенклатура.ВестиУчетСертификатовНоменклатуры,
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Ссылка.Контрагент,
	|	ЗаказКлиентаТовары.Ссылка.Организация,
	|	ЗаказКлиентаТовары.Ссылка.Номер,
	|	ЗаказКлиентаТовары.Ссылка.Дата,
	|	ТИПЗНАЧЕНИЯ(ЗаказКлиентаТовары.Ссылка)
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&МассивОбъектов)
	|	И ЗаказКлиентаТовары.Номенклатура.ВестиУчетСертификатовНоменклатуры = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Номенклатура.ВестиУчетСертификатовНоменклатуры,
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Ссылка.Контрагент,
	|	ЗаказПоставщикуТовары.Ссылка.Организация,
	|	ЗаказПоставщикуТовары.Ссылка.Номер,
	|	ЗаказПоставщикуТовары.Ссылка.Дата,
	|	ТИПЗНАЧЕНИЯ(ЗаказПоставщикуТовары.Ссылка)
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Ссылка КАК Ссылка,
	|	ВТ_Товары.Контрагент КАК Контрагент,
	|	ВТ_Товары.Организация КАК Организация,
	|	ВТ_Товары.Номер КАК НомерДок,
	|	ВТ_Товары.Дата КАК ДатаДок,
	|	ВТ_Товары.ТипДокумента КАК ТипДокумента
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Товары.Ссылка,
	|	ВТ_Товары.Контрагент,
	|	ВТ_Товары.Организация,
	|	ВТ_Товары.Номер,
	|	ВТ_Товары.Дата,
	|	ВТ_Товары.ТипДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры, ЛОЖЬ) КАК СертификатНоменклатуры,
	|	ЕстьNull(ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ДатаНачалаСрокаДействия, ДатаВремя(1,1,1)) КАК ДатаНачалаСрокаДействия,
	|	ЕстьNull(ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ДатаОкончанияСрокаДействия, ДатаВремя(1,1,1)) КАК ДатаОкончанияСрокаДействия,
	|	ЕстьNull(ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.Бессрочный, Ложь) КАК Бессрочный,
	|	ЕстьNull(ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ОрганВыдавшийДокумент, """") КАК ОрганВыдавшийДокумент,
	|	ЕстьNull(ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.Номер, """") КАК НомерСертификата,
	|	ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.Статус КАК Статус,
	|	ВТ_Товары.Ссылка КАК Ссылка,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_Товары.ВестиУчетСертификатовНоменклатуры, Ложь) КАК ВестиУчетСертификатовНоменклатуры
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбластиДействияСертификатовНоменклатуры КАК ОбластиДействияСертификатовНоменклатуры
	|		ПО ВТ_Товары.Номенклатура = ОбластиДействияСертификатовНоменклатуры.Номенклатура";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументы = РезультатЗапроса[1].Выбрать(); //Документы
	ВыборкаДетальныеЗаписи = РезультатЗапроса[2].Выбрать(); // Сертификаты
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока ВыборкаДокументы.Следующий() Цикл
		СтруктураПараметров = Новый Структура;
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;	
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		ТипДокумента = "";
		Если ТипЗнч(ВыборкаДокументы.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			ТипДокумента = "Реализации товаров";
			
		ИначеЕсли ТипЗнч(ВыборкаДокументы.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			
			ТипДокумента = "Приобретению товаров";
			
		ИначеЕсли ТипЗнч(ВыборкаДокументы.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			ТипДокумента = "Заказу клиента";
			
		ИначеЕсли ТипЗнч(ВыборкаДокументы.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
			ТипДокумента = "Заказу поставщику";
			
		КонецЕсли; 
		
		ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("по %1 №%2 от %3", 
		ТипДокумента,
		ВыборкаДокументы.НомерДок,
		Формат(ВыборкаДокументы.ДатаДок, "ДФ='''""''dd''""'' MMMM yyyy ''г.'''"));
		
		СтруктураПараметров.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		
		СтруктураПараметров.Вставить("ПоставщикНаименование",
		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Организация, ВыборкаДокументы.ДатаДок),
		"ПолноеНаименование"));
		СтруктураПараметров.Вставить("ПоставщикАдрес",
		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Организация, ВыборкаДокументы.ДатаДок),
		"ЮридическийАдрес"));
		СтруктураПараметров.Вставить("ПоставщикТелефон",
		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Организация, ВыборкаДокументы.ДатаДок),
		"Телефоны"));
		
		СтруктураПараметров.Вставить("ПокупательНаименование",
		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Контрагент, ВыборкаДокументы.ДатаДок),
		"ПолноеНаименование"));
		СтруктураПараметров.Вставить("ПокупательАдрес",
		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Контрагент, ВыборкаДокументы.ДатаДок),
		"ЮридическийАдрес"));
		СтруктураПараметров.Вставить("ПокупательТелефон",
		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Контрагент, ВыборкаДокументы.ДатаДок),
		"Телефоны"));
		ОбластьШапка.Параметры.Заполнить(СтруктураПараметров);
		
		ТабДок.Вывести(ОбластьШапка);
		
		
		Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабДок.Вывести(Область);
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументы.Ссылка);
		ТипИсточника = ТипЗнч(ВыборкаДокументы.Ссылка);
		
		ВыборкаДетальныеЗаписи.Сбросить();
		НомерСтроки = 0;
		Пока ВыборкаДетальныеЗаписи.НайтиСледующий(СтруктураПоиска) Цикл //перебора массива объектов
			Если (ТипИсточника = Тип("ДокументСсылка.РеализацияТоваровУслуг") или
				ТипИсточника = Тип("ДокументСсылка.ЗаказКлиента")) И
				ВыборкаДетальныеЗаписи.Статус = null Тогда
				
				Продолжить;
				
			КонецЕсли; 
			
			НомерСтроки = НомерСтроки + 1;
			//Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			СтруктураПараметров.Вставить("НомерСтроки", НомерСтроки);
			
			СтруктураПараметров.Вставить("Товар", ВыборкаДетальныеЗаписи.Номенклатура);
			
			ТекстСертификата = "";
			
			Если ВыборкаДетальныеЗаписи.ВестиУчетСертификатовНоменклатуры Тогда
				Область = Макет.ПолучитьОбласть("СтрокаТаблицыЕстьСертификат");
				СтруктураПараметров.Вставить("НомерСертификата", ВыборкаДетальныеЗаписи.НомерСертификата);
				СтруктураПараметров.Вставить("ОрганВыдавшийДокумент", ВыборкаДетальныеЗаписи.ОрганВыдавшийДокумент);

				Если ВыборкаДетальныеЗаписи.Бессрочный Тогда
					
					СтруктураПараметров.Вставить("ДатаОкончанияСрокаДействия", "Бессрочный");
					
					//ТекстСертификата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					//"№%1 без срока окончания выдан %2",
					//ВыборкаДетальныеЗаписи.НомерСертификата,
					//СокрЛП(ВыборкаДетальныеЗаписи.ОрганВыдавшийДокумент));
					
				Иначе
					
					СтруктураПараметров.Вставить("ДатаОкончанияСрокаДействия", Формат(ВыборкаДетальныеЗаписи.ДатаОкончанияСрокаДействия, "ДЛФ=D"));
					
					//ТекстСертификата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					//"№%1 действует до %2 выдан %3",
					//ВыборкаДетальныеЗаписи.НомерСертификата,
					//Формат(ВыборкаДетальныеЗаписи.ДатаОкончанияСрокаДействия,"ДЛФ=DD"),
					//СокрЛП(ВыборкаДетальныеЗаписи.ОрганВыдавшийДокумент));
					
				КонецЕсли; 
				
			Иначе
				
				Область = Макет.ПолучитьОбласть("СтрокаТаблицыНетСертификата");
				ТекстСертификата = "< По номенклатуре не ведется учет сертификатов >";
				
			КонецЕсли;
			
			СтруктураПараметров.Вставить("Сертификат", ТекстСертификата);
			
			Область.Параметры.Заполнить(СтруктураПараметров);
			
			ТабДок.Вывести(Область);
			
		КонецЦикла; //перебора массива объектов 
		
		Область = Макет.ПолучитьОбласть("ПодвалТаблицы");
		СтруктураПараметров.Вставить("ПоставщикНаименование",
		ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДокументы.Организация, ВыборкаДокументы.ДатаДок),
		"ПолноеНаименование"));
		Область.Параметры.Заполнить(СтруктураПараметров);
		
		ТабДок.Вывести(Область);
		
		ВставлятьРазделительСтраниц = Истина;
		//подключимся к общ механизму обл печати
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;	
	Возврат ТабДок;
	
КонецФункции

=======
﻿Функция ПечатьВнешнейПечатнойФормы(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЭтоПриходнаяНакладная = Ложь;
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СертификатыНоменклатуры_РеестрСертификатов";
	
	МассивОбъектовДляЗапроса = МассивОбъектов;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 		
	"ВЫБРАТЬ
	|	ТаблицаТоваровРеализации.Ссылка КАК Ссылка,
	|	ТаблицаТоваровРеализации.Дата КАК Дата,
	|	ТаблицаТоваровРеализации.ЕстьРаспоряжения КАК ЕстьРаспоряжения,
	|	ТаблицаТоваровРеализации.Распоряжение КАК Распоряжение,
	|	ТаблицаТоваровРеализации.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваровРеализации.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваровРеализации.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ СтрокиТоваров
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка КАК Ссылка,
	|		ДанныеДокумента.Дата КАК Дата,
	|		ДанныеДокумента.РеализацияПоЗаказам КАК ЕстьРаспоряжения,
	|		ТаблицаТоваров.ЗаказКлиента КАК Распоряжение,
	|		МАКСИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
	|		ЕСТЬNULL(КлючиАналитики.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|		ЕСТЬNULL(КлючиАналитики.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|			ПО ТаблицаТоваров.Ссылка = ДанныеДокумента.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|			ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.Дата,
	|		ТаблицаТоваров.ЗаказКлиента,
	|		ЕСТЬNULL(КлючиАналитики.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|		ЕСТЬNULL(КлючиАналитики.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	|		ДанныеДокумента.РеализацияПоЗаказам) КАК ТаблицаТоваровРеализации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваровКорректировки.Ссылка,
	|	ТаблицаТоваровКорректировки.Дата,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаТоваровКорректировки.НомерСтроки,
	|	ТаблицаТоваровКорректировки.Номенклатура,
	|	ТаблицаТоваровКорректировки.Характеристика
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка КАК Ссылка,
	|		ДанныеДокумента.Дата КАК Дата,
	|		МАКСИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
	|		ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|		ТаблицаТоваров.Характеристика КАК Характеристика
	|	ИЗ
	|		Документ.КорректировкаРеализации.Товары КАК ТаблицаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК ДанныеДокумента
	|			ПО ТаблицаТоваров.Ссылка = ДанныеДокумента.Ссылка
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.Дата,
	|		ТаблицаТоваров.Номенклатура,
	|		ТаблицаТоваров.Содержание,
	|		ТаблицаТоваров.Характеристика) КАК ТаблицаТоваровКорректировки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваровПеремещения.Ссылка,
	|	ТаблицаТоваровПеремещения.Дата,
	|	ТаблицаТоваровПеремещения.ЕстьРаспоряжения,
	|	ТаблицаТоваровПеремещения.Распоряжение,
	|	ТаблицаТоваровПеремещения.НомерСтроки,
	|	ТаблицаТоваровПеремещения.Номенклатура,
	|	ТаблицаТоваровПеремещения.Характеристика
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка КАК Ссылка,
	|		ДанныеДокумента.Дата КАК Дата,
	|		ДанныеДокумента.ПеремещениеПоЗаказам КАК ЕстьРаспоряжения,
	|		ТаблицаТоваров.ЗаказНаПеремещение КАК Распоряжение,
	|		МАКСИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
	|		ЕСТЬNULL(КлючиАналитики.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|		ЕСТЬNULL(КлючиАналитики.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	|	ИЗ
	|		Документ.ПеремещениеТоваров.Товары КАК ТаблицаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ДанныеДокумента
	|			ПО ТаблицаТоваров.Ссылка = ДанныеДокумента.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|			ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.Дата,
	|		ДанныеДокумента.ПеремещениеПоЗаказам,
	|		ТаблицаТоваров.ЗаказНаПеремещение,
	|		ЕСТЬNULL(КлючиАналитики.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|		ЕСТЬNULL(КлючиАналитики.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ТаблицаТоваровПеремещения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваровПриобретение.Ссылка,
	|	ТаблицаТоваровПриобретение.Дата,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаТоваровПриобретение.НомерСтроки,
	|	ТаблицаТоваровПриобретение.Номенклатура,
	|	ТаблицаТоваровПриобретение.Характеристика
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка КАК Ссылка,
	|		ДанныеДокумента.Дата КАК Дата,
	|		МАКСИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
	|		ЕСТЬNULL(КлючиАналитики.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|		ЕСТЬNULL(КлючиАналитики.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	|	ИЗ
	|		Документ.ПриобретениеТоваровУслуг.Товары КАК ТаблицаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ДанныеДокумента
	|			ПО ТаблицаТоваров.Ссылка = ДанныеДокумента.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|			ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.Дата,
	|		ЕСТЬNULL(КлючиАналитики.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|		ЕСТЬNULL(КлючиАналитики.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ТаблицаТоваровПриобретение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваровЗаказКлиента.Ссылка,
	|	ТаблицаТоваровЗаказКлиента.Дата,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаТоваровЗаказКлиента.НомерСтроки,
	|	ТаблицаТоваровЗаказКлиента.Номенклатура,
	|	ТаблицаТоваровЗаказКлиента.Характеристика
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка КАК Ссылка,
	|		ДанныеДокумента.Дата КАК Дата,
	|		МАКСИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
	|		ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|		ТаблицаТоваров.Характеристика КАК Характеристика
	|	ИЗ
	|		Документ.ЗаказКлиента.Товары КАК ТаблицаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДанныеДокумента
	|			ПО ТаблицаТоваров.Ссылка = ДанныеДокумента.Ссылка
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.Дата,
	|		ТаблицаТоваров.Номенклатура,
	|		ТаблицаТоваров.Содержание,
	|		ТаблицаТоваров.Характеристика) КАК ТаблицаТоваровЗаказКлиента
	|
<<<<<<< HEAD
=======
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
>>>>>>> ad66c8ef0544ceabf4cff338a9d448c011da53f8
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваровЗаказПоставщику.Ссылка,
	|	ТаблицаТоваровЗаказПоставщику.Дата,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаТоваровЗаказПоставщику.НомерСтроки,
	|	ТаблицаТоваровЗаказПоставщику.Номенклатура,
	|	ТаблицаТоваровЗаказПоставщику.Характеристика
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка КАК Ссылка,
	|		ДанныеДокумента.Дата КАК Дата,
	|		МАКСИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
	|		ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|		ТаблицаТоваров.Характеристика КАК Характеристика
	|	ИЗ
	|		Документ.ЗаказПоставщику.Товары КАК ТаблицаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДанныеДокумента
	|			ПО ТаблицаТоваров.Ссылка = ДанныеДокумента.Ссылка
	|	ГДЕ
	|		ТаблицаТоваров.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Ссылка,
	|		ДанныеДокумента.Дата,
	|		ТаблицаТоваров.Номенклатура,
	|		ТаблицаТоваров.Характеристика) КАК ТаблицаТоваровЗаказПоставщику
	|
<<<<<<< HEAD
=======
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 833b09a... feature: реестр сертификтов по Заказу клиента
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
=======
>>>>>>> 833b09a... feature: реестр сертификтов по Заказу клиента
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
>>>>>>> ad66c8ef0544ceabf4cff338a9d448c011da53f8
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Распоряжение,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ВестиУчетСертификатовНоменклатуры
	|ПОМЕСТИТЬ ВсеДокументы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.КорректировкаРеализации КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
<<<<<<< HEAD
=======
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
>>>>>>> ad66c8ef0544ceabf4cff338a9d448c011da53f8
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
<<<<<<< HEAD
=======
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 833b09a... feature: реестр сертификтов по Заказу клиента
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
=======
>>>>>>> 833b09a... feature: реестр сертификтов по Заказу клиента
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
>>>>>>> ad66c8ef0544ceabf4cff338a9d448c011da53f8
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеДокументы.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВсеДокументы.ВестиУчетСертификатовНоменклатуры) КАК ВестиУчетСертификатовНоменклатуры
	|ПОМЕСТИТЬ ДокументыУчетСертификатов
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтрокиТоваров.Ссылка КАК Ссылка,
	|		ЕСТЬNULL(Товары.ВестиУчетСертификатовНоменклатуры, ЛОЖЬ) КАК ВестиУчетСертификатовНоменклатуры
	|	ИЗ
	|		СтрокиТоваров КАК СтрокиТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|			ПО СтрокиТоваров.Номенклатура = Товары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВсеДокументы.Ссылка,
	|		ВсеДокументы.ВестиУчетСертификатовНоменклатуры
	|	ИЗ
	|		ВсеДокументы КАК ВсеДокументы) КАК ВсеДокументы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеДокументы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыУчетСертификатов.Ссылка КАК Ссылка,
	|	ДокументыУчетСертификатов.ВестиУчетСертификатовНоменклатуры КАК ВестиУчетСертификатовНоменклатуры
	|ИЗ
	|	ДокументыУчетСертификатов КАК ДокументыУчетСертификатов
	|ГДЕ
	|	НЕ ДокументыУчетСертификатов.ВестиУчетСертификатовНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыУчетСертификатов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыПоКоторымВедетсяУчетСертификатов
	|ИЗ
	|	ДокументыУчетСертификатов КАК ДокументыУчетСертификатов
	|ГДЕ
	|	ДокументыУчетСертификатов.ВестиУчетСертификатовНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиТоваров.Распоряжение
	|ИЗ
	|	ДокументыУчетСертификатов КАК ДокументыУчетСертификатов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтрокиТоваров КАК СтрокиТоваров
	|		ПО ДокументыУчетСертификатов.Ссылка = СтрокиТоваров.Ссылка
	|ГДЕ
	|	ДокументыУчетСертификатов.ВестиУчетСертификатовНоменклатуры
	|	И СтрокиТоваров.ЕстьРаспоряжения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДвиженияСерийТоваров.Ссылка КАК Ссылка,
	|	ДвиженияСерийТоваров.Номенклатура КАК Номенклатура,
	|	ДвиженияСерийТоваров.Характеристика КАК Характеристика,
	|	ДвиженияСерийТоваров.Серия КАК Серия
	|ПОМЕСТИТЬ ДвиженияСерийТоваров
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияСерийТоваров.Документ КАК Ссылка,
	|		ДвиженияСерийТоваров.Номенклатура КАК Номенклатура,
	|		ДвиженияСерийТоваров.Характеристика КАК Характеристика,
	|		ДвиженияСерийТоваров.Серия КАК Серия
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоКоторымВедетсяУчетСертификатов КАК ДокументыУчетаСертификатов
	|			ПО ДвиженияСерийТоваров.Документ = ДокументыУчетаСертификатов.Ссылка
	|	ГДЕ
	|		ДвиженияСерийТоваров.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
	|		И ДокументыУчетаСертификатов.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияСерийТоваров.Документ,
	|		ДвиженияСерийТоваров.Номенклатура,
	|		ДвиженияСерийТоваров.Характеристика,
	|		ДвиженияСерийТоваров.Серия
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоКоторымВедетсяУчетСертификатов КАК ДокументыУчетаСертификатов
	|			ПО ДвиженияСерийТоваров.Документ = ДокументыУчетаСертификатов.Ссылка
	|	ГДЕ
	|		ДвиженияСерийТоваров.Документ ССЫЛКА Документ.ПеремещениеТоваров
	|		И ДокументыУчетаСертификатов.Ссылка ССЫЛКА Документ.ПеремещениеТоваров
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыУчетаСертификатов.Ссылка,
	|		ДвиженияСерийТоваров.Номенклатура,
	|		ДвиженияСерийТоваров.Характеристика,
	|		ДвиженияСерийТоваров.Серия
	|	ИЗ
	|		Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК ТоварыПоРаспоряжениям
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	|			ПО ТоварыПоРаспоряжениям.Ссылка = ДвиженияСерийТоваров.Документ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоКоторымВедетсяУчетСертификатов КАК ДокументыУчетаСертификатов
	|			ПО ТоварыПоРаспоряжениям.Распоряжение = ДокументыУчетаСертификатов.Ссылка) КАК ДвиженияСерийТоваров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиТоваров.Ссылка КАК Ссылка,
	|	СтрокиТоваров.НомерСтроки КАК НомерСтроки,
	|	СтрокиТоваров.Дата КАК Дата,
	|	ЕСТЬNULL(Товары.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)) КАК ВидНоменклатуры,
	|	СтрокиТоваров.Номенклатура КАК Номенклатура,
	|	СтрокиТоваров.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ДвиженияСерийТоваров.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия
	|ПОМЕСТИТЬ ДокументТовары
	|ИЗ
	|	СтрокиТоваров КАК СтрокиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	|		ПО СтрокиТоваров.Ссылка = ДвиженияСерийТоваров.Ссылка
	|			И СтрокиТоваров.Номенклатура = ДвиженияСерийТоваров.Номенклатура
	|			И СтрокиТоваров.Характеристика = ДвиженияСерийТоваров.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|		ПО СтрокиТоваров.Номенклатура = Товары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоКоторымВедетсяУчетСертификатов КАК ДокументыПоКоторымВедетсяУчетСертификатов
	|		ПО СтрокиТоваров.Ссылка = ДокументыПоКоторымВедетсяУчетСертификатов.Ссылка
	|ГДЕ
	|	СтрокиТоваров.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ЕСТЬNULL(ДвиженияСерийТоваров.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И НЕ СтрокиТоваров.ЕстьРаспоряжения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиТоваров.Ссылка,
	|	СтрокиТоваров.НомерСтроки,
	|	СтрокиТоваров.Дата,
	|	ЕСТЬNULL(Товары.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)),
	|	СтрокиТоваров.Номенклатура,
	|	СтрокиТоваров.Характеристика,
	|	ЕСТЬNULL(ДвиженияСерийТоваров.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ИЗ
	|	СтрокиТоваров КАК СтрокиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК ДвиженияСерийТоваров
	|		ПО СтрокиТоваров.Ссылка = ДвиженияСерийТоваров.Ссылка
	|			И СтрокиТоваров.Номенклатура = ДвиженияСерийТоваров.Номенклатура
	|			И СтрокиТоваров.Характеристика = ДвиженияСерийТоваров.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|		ПО СтрокиТоваров.Номенклатура = Товары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоКоторымВедетсяУчетСертификатов КАК ДокументыПоКоторымВедетсяУчетСертификатов
	|		ПО СтрокиТоваров.Ссылка = ДокументыПоКоторымВедетсяУчетСертификатов.Ссылка
	|ГДЕ
	|	СтрокиТоваров.Ссылка ССЫЛКА Документ.КорректировкаРеализации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиТоваров.Ссылка,
	|	СтрокиТоваров.НомерСтроки,
	|	СтрокиТоваров.Дата,
	|	ЕСТЬNULL(Товары.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)),
	|	СтрокиТоваров.Номенклатура,
	|	СтрокиТоваров.Характеристика,
	|	ЕСТЬNULL(ДвиженияСерийТоваров.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ИЗ
	|	СтрокиТоваров КАК СтрокиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	|		ПО СтрокиТоваров.Ссылка = ДвиженияСерийТоваров.Ссылка
	|			И СтрокиТоваров.Номенклатура = ДвиженияСерийТоваров.Номенклатура
	|			И СтрокиТоваров.Характеристика = ДвиженияСерийТоваров.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|		ПО СтрокиТоваров.Номенклатура = Товары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоКоторымВедетсяУчетСертификатов КАК ДокументыПоКоторымВедетсяУчетСертификатов
	|		ПО СтрокиТоваров.Ссылка = ДокументыПоКоторымВедетсяУчетСертификатов.Ссылка
	|ГДЕ
	|	СтрокиТоваров.Ссылка ССЫЛКА Документ.ПеремещениеТоваров
	|	И ЕСТЬNULL(ДвиженияСерийТоваров.Ссылка, ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)) ССЫЛКА Документ.ПеремещениеТоваров
	|	И НЕ СтрокиТоваров.ЕстьРаспоряжения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиТоваров.Ссылка,
	|	СтрокиТоваров.НомерСтроки,
	|	СтрокиТоваров.Дата,
	|	ЕСТЬNULL(Товары.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)),
	|	СтрокиТоваров.Номенклатура,
	|	СтрокиТоваров.Характеристика,
	|	ЕСТЬNULL(ДвиженияСерийТоваров.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ИЗ
	|	СтрокиТоваров КАК СтрокиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	|		ПО СтрокиТоваров.Распоряжение = ДвиженияСерийТоваров.Ссылка
	|			И СтрокиТоваров.Номенклатура = ДвиженияСерийТоваров.Номенклатура
	|			И СтрокиТоваров.Характеристика = ДвиженияСерийТоваров.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|		ПО СтрокиТоваров.Номенклатура = Товары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоКоторымВедетсяУчетСертификатов КАК ДокументыПоКоторымВедетсяУчетСертификатов
	|		ПО СтрокиТоваров.Распоряжение = ДокументыПоКоторымВедетсяУчетСертификатов.Ссылка
	|ГДЕ
	|	СтрокиТоваров.ЕстьРаспоряжения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиТоваров.Ссылка,
	|	СтрокиТоваров.НомерСтроки,
	|	СтрокиТоваров.Дата,
	|	ЕСТЬNULL(Товары.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)),
	|	СтрокиТоваров.Номенклатура,
	|	СтрокиТоваров.Характеристика,
	|	ЕСТЬNULL(ДвиженияСерийТоваров.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ИЗ
	|	СтрокиТоваров КАК СтрокиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	|		ПО СтрокиТоваров.Ссылка = ДвиженияСерийТоваров.Ссылка
	|			И СтрокиТоваров.Номенклатура = ДвиженияСерийТоваров.Номенклатура
	|			И СтрокиТоваров.Характеристика = ДвиженияСерийТоваров.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|		ПО СтрокиТоваров.Номенклатура = Товары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоКоторымВедетсяУчетСертификатов КАК ДокументыПоКоторымВедетсяУчетСертификатов
	|		ПО СтрокиТоваров.Ссылка = ДокументыПоКоторымВедетсяУчетСертификатов.Ссылка
	|ГДЕ
	|	СтрокиТоваров.Ссылка ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|	И ЕСТЬNULL(ДвиженияСерийТоваров.Ссылка, ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)) ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|	И НЕ СтрокиТоваров.ЕстьРаспоряжения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиТоваров.Ссылка,
	|	СтрокиТоваров.НомерСтроки,
	|	СтрокиТоваров.Дата,
	|	ЕСТЬNULL(Товары.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)),
	|	СтрокиТоваров.Номенклатура,
	|	СтрокиТоваров.Характеристика,
	|	ЕСТЬNULL(ДвиженияСерийТоваров.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ИЗ
	|	СтрокиТоваров КАК СтрокиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	|		ПО СтрокиТоваров.Ссылка = ДвиженияСерийТоваров.Ссылка
	|			И СтрокиТоваров.Номенклатура = ДвиженияСерийТоваров.Номенклатура
	|			И СтрокиТоваров.Характеристика = ДвиженияСерийТоваров.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|		ПО СтрокиТоваров.Номенклатура = Товары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоКоторымВедетсяУчетСертификатов КАК ДокументыПоКоторымВедетсяУчетСертификатов
	|		ПО СтрокиТоваров.Ссылка = ДокументыПоКоторымВедетсяУчетСертификатов.Ссылка
	|ГДЕ
	|	СтрокиТоваров.Ссылка ССЫЛКА Документ.ЗаказКлиента
	|	И ЕСТЬNULL(ДвиженияСерийТоваров.Ссылка, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) ССЫЛКА Документ.ЗаказКлиента
	|	И НЕ СтрокиТоваров.ЕстьРаспоряжения
	|
<<<<<<< HEAD
=======
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
>>>>>>> ad66c8ef0544ceabf4cff338a9d448c011da53f8
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиТоваров.Ссылка,
	|	СтрокиТоваров.НомерСтроки,
	|	СтрокиТоваров.Дата,
	|	ЕСТЬNULL(Товары.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)),
	|	СтрокиТоваров.Номенклатура,
	|	СтрокиТоваров.Характеристика,
	|	ЕСТЬNULL(ДвиженияСерийТоваров.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ИЗ
	|	СтрокиТоваров КАК СтрокиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	|		ПО СтрокиТоваров.Ссылка = ДвиженияСерийТоваров.Ссылка
	|			И СтрокиТоваров.Номенклатура = ДвиженияСерийТоваров.Номенклатура
	|			И СтрокиТоваров.Характеристика = ДвиженияСерийТоваров.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|		ПО СтрокиТоваров.Номенклатура = Товары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыПоКоторымВедетсяУчетСертификатов КАК ДокументыПоКоторымВедетсяУчетСертификатов
	|		ПО СтрокиТоваров.Ссылка = ДокументыПоКоторымВедетсяУчетСертификатов.Ссылка
	|ГДЕ
	|	СтрокиТоваров.Ссылка ССЫЛКА Документ.ЗаказПоставщику
	|	И ЕСТЬNULL(ДвиженияСерийТоваров.Ссылка, ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)) ССЫЛКА Документ.ЗаказПоставщику
	|	И НЕ СтрокиТоваров.ЕстьРаспоряжения
	|
<<<<<<< HEAD
=======
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 833b09a... feature: реестр сертификтов по Заказу клиента
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
=======
>>>>>>> 833b09a... feature: реестр сертификтов по Заказу клиента
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
>>>>>>> ad66c8ef0544ceabf4cff338a9d448c011da53f8
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументТовары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.Характеристика КАК Характеристика,
	|	ДокументТовары.Серия КАК Серия
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	ДокументТовары КАК ДокументТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ДанныеНоменклатуры
	|		ПО ДокументТовары.Номенклатура = ДанныеНоменклатуры.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(ДанныеНоменклатуры.ВестиУчетСертификатовНоменклатуры, ЛОЖЬ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	ОбластиДействияСертификатов.СертификатНоменклатуры КАК СертификатНоменклатуры,
	|	ОбластиДействияСертификатов.СертификатНоменклатуры.ТипСертификата КАК ТипСертификата,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ОбластиДействияСертификатов.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|				ТОГДА 1
	|			КОГДА ОбластиДействияСертификатов.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ТОГДА 2
	|			КОГДА ОбластиДействияСертификатов.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ТОГДА 3
	|			КОГДА ОбластиДействияСертификатов.СертификатНоменклатуры ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 4
	|		КОНЕЦ) КАК ПриоритетСертификата,
	|	ВЫБОР
	|		КОГДА ОбластиДействияСертификатов.СертификатНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСертификатовНоменклатуры.Действующий)
	|			ТОГДА ВЫБОР
	|					КОГДА ОбластиДействияСертификатов.СертификатНоменклатуры.Бессрочный
	|						ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|					ИНАЧЕ ОбластиДействияСертификатов.СертификатНоменклатуры.ДатаОкончанияСрокаДействия
	|				КОНЕЦ
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ОкончаниеСрокаДействия,
	|	ВЫБОР
	|		КОГДА ОбластиДействияСертификатов.СертификатНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСертификатовНоменклатуры.Действующий)
	|			ТОГДА ОбластиДействияСертификатов.СертификатНоменклатуры.ДатаНачалаСрокаДействия
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК НачалоСрокаДействия
	|ПОМЕСТИТЬ ТоварыССертификатами
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбластиДействияСертификатовНоменклатуры КАК ОбластиДействияСертификатов
	|		ПО (Товары.ВидНоменклатуры = ОбластиДействияСертификатов.ВидНоменклатуры
	|					И Товары.Номенклатура = ОбластиДействияСертификатов.Номенклатура
	|					И Товары.Характеристика = ОбластиДействияСертификатов.Характеристика
	|					И Товары.Серия = ОбластиДействияСертификатов.Серия
	|				ИЛИ Товары.ВидНоменклатуры = ОбластиДействияСертификатов.ВидНоменклатуры
	|					И Товары.Номенклатура = ОбластиДействияСертификатов.Номенклатура
	|					И Товары.Характеристика = ОбластиДействияСертификатов.Характеристика
	|					И ОбластиДействияСертификатов.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|				ИЛИ Товары.ВидНоменклатуры = ОбластиДействияСертификатов.ВидНоменклатуры
	|					И Товары.Номенклатура = ОбластиДействияСертификатов.Номенклатура
	|					И ОбластиДействияСертификатов.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|					И ОбластиДействияСертификатов.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|				ИЛИ Товары.ВидНоменклатуры = ОбластиДействияСертификатов.ВидНоменклатуры
	|					И ОбластиДействияСертификатов.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|					И ОбластиДействияСертификатов.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|					И ОбластиДействияСертификатов.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|ГДЕ
	|	НЕ ОбластиДействияСертификатов.СертификатНоменклатуры.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.ВидНоменклатуры,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	ОбластиДействияСертификатов.СертификатНоменклатуры,
	|	ОбластиДействияСертификатов.СертификатНоменклатуры.ТипСертификата,
	|	ВЫБОР
	|		КОГДА ОбластиДействияСертификатов.СертификатНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСертификатовНоменклатуры.Действующий)
	|			ТОГДА ВЫБОР
	|					КОГДА ОбластиДействияСертификатов.СертификатНоменклатуры.Бессрочный
	|						ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|					ИНАЧЕ ОбластиДействияСертификатов.СертификатНоменклатуры.ДатаОкончанияСрокаДействия
	|				КОНЕЦ
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОбластиДействияСертификатов.СертификатНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСертификатовНоменклатуры.Действующий)
	|			ТОГДА ОбластиДействияСертификатов.СертификатНоменклатуры.ДатаНачалаСрокаДействия
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка КАК Ссылка,
	|	ДокументТовары.НомерСтроки КАК НомерСтроки,
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.Номенклатура.НаименованиеПолное КАК НаименованиеНоменклатуры,
	|	ДокументТовары.Характеристика КАК Характеристика,
	|	ДокументТовары.Характеристика.НаименованиеПолное КАК НаименованиеХарактеристики,
	|	ДокументТовары.Серия КАК Серия,
	|	ДокументТовары.Номенклатура.ВестиУчетСертификатовНоменклатуры КАК ВестиУчетСертификатовНоменклатуры,
	|	ВЫБОР
	|		КОГДА ДокументТовары.Номенклатура.ВестиУчетСертификатовНоменклатуры
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыССертификатами.СертификатНоменклатуры ЕСТЬ NULL
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетДействующихСертификатов,
	|	ВЫБОР
	|		КОГДА ДокументТовары.Номенклатура.ВестиУчетСертификатовНоменклатуры
	|			ТОГДА ЕСТЬNULL(ТоварыССертификатами.СертификатНоменклатуры, ЗНАЧЕНИЕ(Справочник.СертификатыНоменклатуры.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СертификатыНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК СертификатНоменклатуры,
	|	ЕСТЬNULL(ТоварыССертификатами.ТипСертификата, """") КАК ТипСертификата,
	|	ЕСТЬNULL(ТоварыССертификатами.ПриоритетСертификата, 4) КАК ПриоритетСертификата,
	|	ВЫБОР
	|		КОГДА ДокументТовары.Номенклатура.ВестиУчетСертификатовНоменклатуры
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыССертификатами.СертификатНоменклатуры ЕСТЬ NULL
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТоварыССертификатами.ОкончаниеСрокаДействия >= ДокументТовары.Дата
	|									ИЛИ ДокументТовары.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
	|								ТОГДА ИСТИНА
	|							ИНАЧЕ ЛОЖЬ
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СертификатДействует,
	|	ВЫБОР
	|		КОГДА ДокументТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратнаяТара,
	|	ВЫБОР
	|		КОГДА ТоварыССертификатами.СертификатНоменклатуры.Бессрочный
	|			ТОГДА ""Бессрочный""
	|		ИНАЧЕ ТоварыССертификатами.СертификатНоменклатуры.ДатаОкончанияСрокаДействия
	|	КОНЕЦ КАК СрокДействия,
	|	ТоварыССертификатами.СертификатНоменклатуры.ОрганВыдавшийДокумент КАК ОрганВыдавшийСертификат,
	|	ТоварыССертификатами.СертификатНоменклатуры.Номер КАК РегистрационныйНомер
	|ИЗ
	|	ДокументТовары КАК ДокументТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыССертификатами КАК ТоварыССертификатами
	|		ПО ДокументТовары.Номенклатура = ТоварыССертификатами.Номенклатура
	|			И ДокументТовары.Характеристика = ТоварыССертификатами.Характеристика
	|			И ДокументТовары.Серия = ТоварыССертификатами.Серия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки,
	|	Номенклатура,
	|	Характеристика,
	|	ТипСертификата УБЫВ,
	|	Серия,
	|	СертификатДействует УБЫВ,
	|	ПриоритетСертификата
	|ИТОГИ ПО
	|	Ссылка,
	|	НомерСтроки,
	|	Номенклатура,
	|	Характеристика,
	|	ТипСертификата,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеРеализации.Номер КАК Номер,
	|	ДанныеРеализации.Дата КАК Дата,
	|	ДанныеРеализации.Представление КАК Представление,
	|	ДанныеДокументов.Ссылка.Контрагент КАК Контрагент,
	|	ДанныеДокументов.Ссылка.Организация КАК Организация
	|ИЗ
	|	ДокументыПоКоторымВедетсяУчетСертификатов КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДанныеРеализации
	|		ПО ДанныеДокументов.Ссылка = ДанныеРеализации.Ссылка
	|ГДЕ
	|	ДанныеДокументов.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеКорректировки.Номер,
	|	ДанныеКорректировки.Дата,
	|	ДанныеКорректировки.Представление,
	|	NULL,
	|	NULL
	|ИЗ
	|	ДокументыПоКоторымВедетсяУчетСертификатов КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК ДанныеКорректировки
	|		ПО ДанныеДокументов.Ссылка = ДанныеКорректировки.Ссылка
	|ГДЕ
	|	ДанныеДокументов.Ссылка ССЫЛКА Документ.КорректировкаРеализации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка,
	|	ДанныеПеремещения.Номер,
	|	ДанныеПеремещения.Дата,
	|	ДанныеПеремещения.Представление,
	|	NULL,
	|	NULL
	|ИЗ
	|	ДокументыПоКоторымВедетсяУчетСертификатов КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ДанныеПеремещения
	|		ПО ДанныеДокументов.Ссылка = ДанныеПеремещения.Ссылка
	|ГДЕ
	|	ДанныеДокументов.Ссылка ССЫЛКА Документ.ПеремещениеТоваров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка,
	|	ПриобретениеТоваровУслуг.Номер,
	|	ПриобретениеТоваровУслуг.Дата,
	|	ПриобретениеТоваровУслуг.Представление,
	|	ДанныеДокументов.Ссылка.Контрагент,
	|	ДанныеДокументов.Ссылка.Организация
	|ИЗ
	|	ДокументыПоКоторымВедетсяУчетСертификатов КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|		ПО ДанныеДокументов.Ссылка = ПриобретениеТоваровУслуг.Ссылка
	|ГДЕ
	|	ДанныеДокументов.Ссылка ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Представление,
	|	ДанныеДокументов.Ссылка.Контрагент,
	|	ДанныеДокументов.Ссылка.Организация
	|ИЗ
	|	ДокументыПоКоторымВедетсяУчетСертификатов КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО ДанныеДокументов.Ссылка = ЗаказКлиента.Ссылка
	|ГДЕ
	|	ДанныеДокументов.Ссылка ССЫЛКА Документ.ЗаказКлиента
	|
<<<<<<< HEAD
=======
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
>>>>>>> ad66c8ef0544ceabf4cff338a9d448c011da53f8
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка,
	|	ЗаказПоставщику.Номер,
	|	ЗаказПоставщику.Дата,
	|	ЗаказПоставщику.Представление,
	|	ДанныеДокументов.Ссылка.Контрагент,
	|	ДанныеДокументов.Ссылка.Организация
	|ИЗ
	|	ДокументыПоКоторымВедетсяУчетСертификатов КАК ДанныеДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ПО ДанныеДокументов.Ссылка = ЗаказПоставщику.Ссылка
	|ГДЕ
	|	ДанныеДокументов.Ссылка ССЫЛКА Документ.ЗаказПоставщику
	|
<<<<<<< HEAD
=======
<<<<<<< HEAD
<<<<<<< HEAD
=======
>>>>>>> 833b09a... feature: реестр сертификтов по Заказу клиента
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
=======
>>>>>>> 833b09a... feature: реестр сертификтов по Заказу клиента
=======
>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
>>>>>>> ad66c8ef0544ceabf4cff338a9d448c011da53f8
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Если ТипЗнч(МассивОбъектов[0]) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
	
		//ТекстЗапроса = Запрос.Текст;
		//Текстзапроса = СтрЗаменить(ТекстЗапроса, "Документ.РеализацияТоваровУслуг", "Документ.ПриобретениеТоваровУслуг");
		//Запрос.Текст = ТекстЗапроса;
	    ЭтоПриходнаяНакладная = Истина;
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектовДляЗапроса);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ДанныеПечати = МассивРезультатов[10].Выбрать();	
	ВыборкаПоДокументам = МассивРезультатов[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ВыборкаПоДокументамБезУчетаСертификатов = МассивРезультатов[3].Выбрать();
	
	Макет = ЭтотОбъект.ПолучитьМакет("ПФ_MXL_РеестрСертификатов");
			
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Область = Макет.ПолучитьОбласть("Шапка");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, Область, ДанныеПечати.Ссылка);
		СтруктураПараметров = Новый Структура;
		
		СтруктураПараметров.Вставить("ДатаДок", Формат(ДанныеПечати.Дата, "ДФ='''""''dd''""'' MMMM yyyy ''г.'''"));
		СтруктураПараметров.Вставить("НомерДок", ДанныеПечати.Номер);
		
		ТипДокумента = "";
		Если ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
			ТипДокумента = "Реализации товаров";
			
		ИначеЕсли ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			
			ТипДокумента = "Приобретению товаров";
			
		ИначеЕсли ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			ТипДокумента = "Заказу клиента";
			
		ИначеЕсли ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
			ТипДокумента = "Заказу поставщику";
		
		КонецЕсли; 
		
		ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("по %1 №%2 от %3", 
			ТипДокумента,
			СтруктураПараметров.НомерДок,
			СтруктураПараметров.ДатаДок);
			
		СтруктураПараметров.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		
		СтруктураПараметров.Вставить("ПоставщикНаименование",
			ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата),
			"ПолноеНаименование"));
		СтруктураПараметров.Вставить("ПоставщикАдрес",
			ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата),
			"ЮридическийАдрес"));
		СтруктураПараметров.Вставить("ПоставщикТелефон",
			ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата),
			"Телефоны"));
			
		СтруктураПараметров.Вставить("ПокупательНаименование",
			ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата),
			"ПолноеНаименование"));
		СтруктураПараметров.Вставить("ПокупательАдрес",
			ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата),
			"ЮридическийАдрес"));
		СтруктураПараметров.Вставить("ПокупательТелефон",
			ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата),
			"Телефоны"));
				
		Область.Параметры.Заполнить(СтруктураПараметров);
				
		ТабличныйДокумент.Вывести(Область);
				
		// Создаем массивы для проверки вывода
		МассивВыводимыхОбластей = Новый Массив;
		
		//ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		//СтруктураПараметров = Новый Структура;
		//СтруктураПараметров.Вставить("НомерСтраницы", "Страница " + 1);
		//ОбластьЗаголовокТаблицы.Параметры.Заполнить(СтруктураПараметров);
		//ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);

		Область = Макет.ПолучитьОбласть("ШапкаТаблицы|НачалоСтроки");
		ТабличныйДокумент.Вывести(Область);
		Область = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаТоваров");
		ТабличныйДокумент.Присоединить(Область);
		Область = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаСертификатов");
		ТабличныйДокумент.Присоединить(Область);
		
		НомерСтраницы = 2;
		НомерСтроки = 1;
		ОбластьПерваяСтрокаКолонкаТоваров = Неопределено;
		ОбластьПерваяСтрокаНачалоСтроки = Неопределено;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
		
		ВыборкаПоНомеруСтроки = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоНомеруСтроки.Следующий() Цикл
			
			ВывестиСтрокиДляПозицииТоваров(
				ТабличныйДокумент,
				Макет,
				ОбластьПерваяСтрокаКолонкаТоваров,
				НомерСтраницы,
				НомерСтроки,
				МассивВыводимыхОбластей);

			ВыборкаПоНоменклатуре = ВыборкаПоНомеруСтроки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоНоменклатуре.Следующий() Цикл
				
				ВыборкаПоХарактеристике = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоХарактеристике.Следующий() Цикл
																
					ОбластьПерваяСтрокаНачалоСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы|НачалоСтроки");
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("НомерСтроки",НомерСтроки);
					ОбластьПерваяСтрокаНачалоСтроки.Параметры.Заполнить(СтруктураПараметров);
												
					ОбластьПерваяСтрокаКолонкаТоваров = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаТоваров");
					ОбластьПерваяСтрокаКолонкаТоваров.Параметры.Заполнить(ВыборкаПоХарактеристике);
					
					ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
						ВыборкаПоХарактеристике.НаименованиеНоменклатуры,
						ВыборкаПоХарактеристике.НаименованиеХарактеристики);
					
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("Товар",ПредставлениеНоменклатуры);
					ОбластьПерваяСтрокаКолонкаТоваров.Параметры.Заполнить(СтруктураПараметров);			
										
					ВыборкаПоТипуСертификата = ВыборкаПоХарактеристике.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПоТипуСертификата.Следующий() Цикл
						
						МассивСертификатов = Новый Массив;
						ПрерватьВыборкуПоСериям = Ложь;
						ВыборкаПоСериям = ВыборкаПоТипуСертификата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаПоСериям.Следующий() Цикл
														
								Выборка = ВыборкаПоСериям.Выбрать();
								ПрерватьВыборку = Ложь;
								ДействующийСертификатДляСерииДобавлен = Ложь;
								Пока Выборка.Следующий() Цикл
									
									Если Не Выборка.ВестиУчетСертификатовНоменклатуры Тогда
										
										ОбластьСертификат = Макет.ПолучитьОбласть("СтрокаТаблицыСертификатНеНайден|КолонкаСертификатов");
										СтруктураПараметров = Новый Структура;
										СтруктураПараметров.Вставить("Сертификат",НСтр("ru='<Учет сертификатов не ведется>'"));
										ОбластьСертификат.Параметры.Заполнить(СтруктураПараметров);	
										
										ПрерватьВыборкуПоСериям = Истина;
										ПрерватьВыборку = Истина;
										
									ИначеЕсли Выборка.НетДействующихСертификатов Тогда
										
										ОбластьСертификат = Макет.ПолучитьОбласть("СтрокаТаблицыСертификатЖирный|КолонкаСертификатов");
										СтруктураПараметров = Новый Структура;
										СтруктураПараметров.Вставить("Сертификат",НСтр("ru='<Нет действующих сертификатов>'"));
										ОбластьСертификат.Параметры.Заполнить(СтруктураПараметров);			
											
										Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = 'Для товара %1 отсутствуют зарегистрированные сертификаты. Требуется указать сертификаты номенклатуры.'"),
											ПредставлениеНоменклатуры);
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
											Текст,
											Выборка.Номенклатура);
																				
										ПрерватьВыборкуПоСериям = Истина;
										ПрерватьВыборку = Истина;										
										
									ИначеЕсли Не Выборка.СертификатДействует Тогда
										
										Если ДействующийСертификатДляСерииДобавлен Тогда
											Прервать;	
										КонецЕсли;
										
										Если ЗначениеЗаполнено(Выборка.Серия) Тогда
											ТексткОшибки = НСтр("ru='<%ТипСертификата%: нет действующих сертификатов для серии %Серия%>'");
											
											ПредставлениеНоменклатурыССерией = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
												ВыборкаПоХарактеристике.НаименованиеНоменклатуры,
												ВыборкаПоХарактеристике.НаименованиеХарактеристики,
												,
												Выборка.Серия);
											
											Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
												НСтр("ru = 'Для товара %1 нет действующих сертификатов (%2). Требуется зарегистрировать действующий сертификат.'"),
												ПредставлениеНоменклатурыССерией,
												Выборка.ТипСертификата);
										Иначе 
											ТексткОшибки = НСтр("ru='<%ТипСертификата%: нет действующих сертификатов>'");
											Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
												НСтр("ru = 'Для товара %1 нет действующих сертификатов (%2). Требуется зарегистрировать действующий сертификат.'"),
												ПредставлениеНоменклатуры,
												Выборка.ТипСертификата);
										КонецЕсли;
										
										ПрерватьВыборку = Истина;
										ТексткОшибки = СтрЗаменить(ТексткОшибки,"%ТипСертификата%",Выборка.ТипСертификата);
										ТексткОшибки = СтрЗаменить(ТексткОшибки,"%Серия%",Выборка.Серия);
										ОбластьСертификат = Макет.ПолучитьОбласть("СтрокаТаблицыСертификатЖирный|КолонкаСертификатов");
										СтруктураПараметров = Новый Структура;
										СтруктураПараметров.Вставить("Сертификат",ТексткОшибки);
										ОбластьСертификат.Параметры.Заполнить(СтруктураПараметров);															
										
										ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
												Текст,
												Выборка.Номенклатура);

									Иначе
										
										Если МассивСертификатов.Найти(Выборка.СертификатНоменклатуры) = Неопределено Тогда 			
											ОбластьСертификат = Макет.ПолучитьОбласть("СтрокаТаблицыСертификат|КолонкаСертификатов");
											СтруктураПараметров = Новый Структура;
											СтруктураПараметров.Вставить("Сертификат", Выборка.СертификатНоменклатуры);
											СтруктураПараметров.Вставить("СертификатНоменклатуры", Выборка.СертификатНоменклатуры);
											СтруктураПараметров.Вставить("РегистрационныйНомер", Выборка.РегистрационныйНомер);
											СтруктураПараметров.Вставить("СрокДействия", Формат(Выборка.СрокДействия, "ДФ=dd.MM.yyyy"));
											СтруктураПараметров.Вставить("ОрганВыдавшийСертификат", Выборка.ОрганВыдавшийСертификат);
											
											ОбластьСертификат.Параметры.Заполнить(СтруктураПараметров);
											
											МассивСертификатов.Добавить(Выборка.СертификатНоменклатуры);
											ДействующийСертификатДляСерииДобавлен = Истина;
										Иначе
											Продолжить;
										КонецЕсли

									КонецЕсли;
																				
									МассивВыводимыхОбластей.Добавить(ОбластьСертификат);
																		
									Если ПрерватьВыборку Тогда
										Прервать;
									КонецЕсли;	
									
								КонецЦикла;	
								
								Если ПрерватьВыборкуПоСериям Тогда
									Прервать;
								КонецЕсли;								

						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;

		ВывестиСтрокиДляПозицииТоваров(
			ТабличныйДокумент,
			Макет,
			ОбластьПерваяСтрокаКолонкаТоваров,
			НомерСтраницы,
			НомерСтроки,
			МассивВыводимыхОбластей);
		
		Область = Макет.ПолучитьОбласть("ПодвалТаблицы");
		СтруктураПараметров.Вставить("ПоставщикНаименование",
			ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата),
			"ПолноеНаименование"));
		Область.Параметры.Заполнить(СтруктураПараметров);
		
		ТабличныйДокумент.Вывести(Область);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Пока ВыборкаПоДокументамБезУчетаСертификатов.Следующий() Цикл
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В документе %1 отсутствуют товары, для которых ведется учет сертификатов. Печать реестра сертификатов номенклатуры не требуется.'"),
			Строка(ВыборкаПоДокументамБезУчетаСертификатов.Ссылка));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ВыборкаПоДокументамБезУчетаСертификатов.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ВывестиСтрокиДляПозицииТоваров(ТабличныйДокумент,Макет,ОбластьПерваяСтрокаКолонкаТоваров,НомерСтраницы,НомерСтроки,МассивВыводимыхОбластей)
	
	Если ОбластьПерваяСтрокаКолонкаТоваров <> Неопределено Тогда
		
		ПерваяСтрока = Истина;
		ВыводитьРазделитель = Ложь;
		
		Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда	
			ВыводитьРазделитель = Истина;				
		КонецЕсли;
		
		Если ВыводитьРазделитель Тогда
			
			Область = Макет.ПолучитьОбласть("ПодвалТаблицыРазделитель|НачалоСтроки");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("ПодвалТаблицыРазделитель|КолонкаТоваров");
			ТабличныйДокумент.Присоединить(Область);
			Область = Макет.ПолучитьОбласть("ПодвалТаблицыРазделитель|КолонкаСертификатов");
			ТабличныйДокумент.Присоединить(Область);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			//ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			//СтруктураПараметров = Новый Структура;
			//СтруктураПараметров.Вставить("НомерСтраницы", "Страница " + НомерСтраницы);
			//ОбластьЗаголовокТаблицы.Параметры.Заполнить(СтруктураПараметров);
			//ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
			//НомерСтраницы = НомерСтраницы + 1;
			
			Область = Макет.ПолучитьОбласть("ШапкаТаблицы|НачалоСтроки");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаТоваров");
			ТабличныйДокумент.Присоединить(Область);
			Область = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаСертификатов");
			ТабличныйДокумент.Присоединить(Область);
			
		КонецЕсли;	
		
		Для Каждого ОбластьСертификат Из МассивВыводимыхОбластей Цикл
			
			Если ПерваяСтрока Тогда
				
				ОбластьПерваяСтрокаНачалоСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы|НачалоСтроки");
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("НомерСтроки", НомерСтроки);
				ОбластьПерваяСтрокаНачалоСтроки.Параметры.Заполнить(СтруктураПараметров);
				
				ТабличныйДокумент.Вывести(ОбластьПерваяСтрокаНачалоСтроки);
				ТабличныйДокумент.Присоединить(ОбластьПерваяСтрокаКолонкаТоваров);
				
				ПерваяСтрока = Ложь;
			Иначе	
				Область = Макет.ПолучитьОбласть("СтрокаТаблицыСертификат|НачалоСтроки");
				ТабличныйДокумент.Вывести(Область);
				
				Область = Макет.ПолучитьОбласть("СтрокаТаблицыСертификат|КолонкаТоваров");
				ТабличныйДокумент.Присоединить(Область);
			КонецЕсли;	
			
			ТабличныйДокумент.Присоединить(ОбластьСертификат);
		КонецЦикла;	
		
		МассивВыводимыхОбластей.Очистить();
		НомерСтроки = НомерСтроки + 1;
	КонецЕсли;
	
КонецПроцедуры		

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	// Реализация логики команды печати
	//Если ИдентификаторКоманды = ... Тогда
	//  ...
	//ИначеЕсли ...
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_РеестрСертификатов") Тогда 
		ТабличныйДокумент = ПечатьВнешнейПечатнойФормы(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_РеестрСертификатов", "ВНЕШНИЙ: Реестр сертификатов", ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

#Область СведенияОВнешнейОбработке
Функция СведенияОВнешнейОбработке() Экспорт
		
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.3.4.82");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
	ПараметрыРегистрации.Версия = "1.3";
	ПараметрыРегистрации.Наименование = "Реестр сертификатов (внешний)";
	ПараметрыРегистрации.Назначение.Добавить("Документ.РеализацияТоваровУслуг");
	ПараметрыРегистрации.Назначение.Добавить("Документ.ПриобретениеТоваровУслуг");
	ПараметрыРегистрации.Назначение.Добавить("Документ.ЗаказКлиента");
<<<<<<< HEAD
	ПараметрыРегистрации.Назначение.Добавить("Документ.ЗаказПоставщику");

=======
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
	ПараметрыРегистрации.Назначение.Добавить("Документ.ЗаказПоставщику");

=======
>>>>>>> 833b09a... feature: реестр сертификтов по Заказу клиента
=======
	ПараметрыРегистрации.Назначение.Добавить("Документ.ЗаказПоставщику");

>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
=======
>>>>>>> 833b09a... feature: реестр сертификтов по Заказу клиента
=======
	ПараметрыРегистрации.Назначение.Добавить("Документ.ЗаказПоставщику");

>>>>>>> c3a921d... feature: печать Реестра сертификатов из ЗаказаПоставщику
>>>>>>> ad66c8ef0544ceabf4cff338a9d448c011da53f8
	
	ПараметрыРегистрации.Информация = "Печатная форма работает только для УТ не ниже версии 11.4.2.139 |" +
		"версия 1.3 - Добавил печать из ЗаказаКлиента";
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'ВНЕШНИЙ: Реестр сертификатов'");
	НоваяКоманда.Идентификатор = "ПФ_MXL_РеестрСертификатов";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	НоваяКоманда.ПоказыватьОповещение = Истина;
	НоваяКоманда.Модификатор = "ПечатьMXL";
	

	Возврат ПараметрыРегистрации;
	
КонецФункции
#КонецОбласти
>>>>>>> develop
